## Plans :thumbsup:
## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>



## Dir: . | Success :thumbsup:
**Dir**: .
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_iam_policy.iam_policy_for_lambda will be created
+   resource "aws_iam_policy" "iam_policy_for_lambda" {
+       arn         = (known after apply)
+       description = "AWS IAM Policy for managing aws lambda role"
+       id          = (known after apply)
+       name        = "aws_iam_policy_for_terraform_aws_lambda_role"
+       name_prefix = (known after apply)
+       path        = "/"
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "logs:CreateLogGroup",
+                           "logs:CreateLogStream",
+                           "logs:PutLogEvents",
                        ]
+                       Effect   = "Allow"
+                       Resource = "arn:aws:logs:*:*:*"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id   = (known after apply)
+       tags_all    = (known after apply)
    }

  # aws_iam_role.lambda_role will be created
+   resource "aws_iam_role" "lambda_role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "lambda.amazonaws.com"
                        }
+                       Sid       = ""
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "terraform_aws_lambda_role"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.attach_iam_policy_to_iam_role will be created
+   resource "aws_iam_role_policy_attachment" "attach_iam_policy_to_iam_role" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "terraform_aws_lambda_role"
    }

  # aws_lambda_function.terraform_lambda_func will be created
+   resource "aws_lambda_function" "terraform_lambda_func" {
+       architectures                  = (known after apply)
+       arn                            = (known after apply)
+       filename                       = "./python/hello-python.zip"
+       function_name                  = "Jhooq-Lambda-Function"
+       handler                        = "hello-python.lambda_handler"
+       id                             = (known after apply)
+       invoke_arn                     = (known after apply)
+       last_modified                  = (known after apply)
+       memory_size                    = 128
+       package_type                   = "Zip"
+       publish                        = false
+       qualified_arn                  = (known after apply)
+       qualified_invoke_arn           = (known after apply)
+       reserved_concurrent_executions = -1
+       role                           = (known after apply)
+       runtime                        = "python3.8"
+       signing_job_arn                = (known after apply)
+       signing_profile_version_arn    = (known after apply)
+       skip_destroy                   = false
+       source_code_hash               = (known after apply)
+       source_code_size               = (known after apply)
+       tags_all                       = (known after apply)
+       timeout                        = 3
+       version                        = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   teraform_aws_role_arn_output = (known after apply)
+   teraform_aws_role_output     = "terraform_aws_lambda_role"
+   teraform_logging_arn_output  = (known after apply)

```


</details>

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
